In [1]:
import pandas as pd

In [2]:
l=[1,2,3,4,5,6]

In [3]:
pd.DataFrame(l)

   0
0  1
1  2
2  3
3  4
4  5
5  6

## using dictionary

In [4]:
dic={'a':[1,2,3,4,5],'b':[2,3,4,3,4]}
pd.DataFrame(dic)

   a  b
0  1  2
1  2  3
2  3  4
3  4  3
4  5  4

## TO GET REQUIRED COLUMN ONLY

In [6]:
pd.DataFrame(dic,columns=['a'])#only give column of a

   a
0  1
1  2
2  3
3  4
4  5

In [8]:
pd.DataFrame(dic,columns=['a'],index=['i','ii','iii','iv','v'])

     a
i    1
ii   2
iii  3
iv   4
v    5

### TO GET CERTIAN DATA WITH ROW NAME AND INDEX

In [9]:
d={'a':[1,2,3,4],'b':[3,4,5,4],'c':[4,5,6,7]}

In [10]:
x=pd.DataFrame(d)

In [12]:
x['b'][2]#dataset['rowname'][index_number]

5

### USING LISTS OF LIST

In [13]:
l=[[1,32,3],[43,3,2]]

In [14]:
var2=pd.DataFrame(l)

In [15]:
var2

    0   1  2
0   1  32  3
1  43   3  2

In [18]:
sr={'s':pd.Series([1,2,3,4]),'b':pd.Series([3,2,3,4])}

In [19]:
pd.DataFrame(sr)

   s  b
0  1  3
1  2  2
2  3  3
3  4  4